demo-5.org
#+TITLE:     lispy.el demo 5: Drink up me hearties
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="demo-style.css"/>

| [[https://github.com/abo-abo/lispy][Back to github]] | [[https://raw.githubusercontent.com/abo-abo/lispy/gh-pages/demo-5.org][This file in org-mode]] | [[http://abo-abo.github.io/lispy/][Function reference]] |

* Setup                                                                               :noexport:
#+begin_src emacs-lisp :exports results :results silent
(setq org-html-validation-link nil)
(setq org-html-postamble nil)
(setq org-html-preamble "<link rel=\"icon\" type=\"image/x-icon\" href=\"https://github.com/favicon.ico\"/>")
(setq org-html-text-markup-alist
  '((bold . "<b>%s</b>")
    (code . "<kbd>%s</kbd>")
    (italic . "<i>%s</i>")
    (strike-through . "<del>%s</del>")
    (underline . "<span class=\"underline\">%s</span>")
    (verbatim . "<code>%s</code>")))
(setq org-html-style-default nil)
(setq org-html-head-include-scripts nil)
#+end_src

* Intro
This demo will showcase quickly writing a 100 beer bottles program
with lispy.

* Task summary
Generate this source:
#+begin_src elisp
(setq b 497)
(let ((x '("take one down, pass it around ..."
           "%s bottles of beer ..."
           "%s bottles of beer on the wall..."
           "----------------------------------------"
           "%s bottles of beer on the wall.")))
  (message (nth (% b 5) x) (/ (decf b) 5)))
#+end_src

Write a program that outputs the 100 bottles of beer thing.

* Screencast
The screencast for this demo is here: http://youtu.be/tcI4gZ3eHaw
* Step-by-step
** step 1
~(setq b 497~
** step 2
- @@html:<kbd>@@C-3 C-m(let((x'("@@html:</kbd>@@
- ~%s bottles of beer on the wall...~
